# Brewfile
# This file was automatically generated based on your configuration

# Terminal and Shell Utilities
brew "git"
cask "wezterm"
cask "font-meslo-lg-nerd-font"
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "eza"  # Better ls replacement
brew "zoxide"  # Better cd replacement
brew "tmux"  # Terminal multiplexer
brew "bash"  # Newer version of bash (for tmux theme)

# CLI Tools
brew "wget"
brew "curl"
brew "ripgrep"  # Better grep
brew "tree"     # Directory listings as trees
brew "jq"       # JSON processor
brew "htop"     # Interactive process viewer
brew "ffmpeg"   # Media processing

# Development Tools
brew "node"
brew "python"
cask "visual-studio-code"
cask "docker"

# Productivity
cask "rectangle"  # Window manager
cask "obsidian"   # Knowledge base and note-taking app
cask "standard-notes"  # Encrypted notes app

# Browsers
cask "google-chrome"
cask "firefox"

# Communication
cask "slack"
cask "zoom"

# Utilities
cask "the-unarchiver"
